/* A single strings file, whose title is specified in your preferences schema. The strings files provide the localized content to display to the user for each of your preferences. */


"mgc_no_net_title" = "The network is not good";
"mgc_no_net_retry_title" = "Retry";
"mgc_mini_game_api_no_available_account" = "Lack of effective accounts";
"mgc_mini_game_api_no_available_controller" = "Pass in a valid controller";
"mgc_mini_game_api_no_available_navi_controller" = "Pass in the navigation controller";
"mgc_mini_game_api_check_login_alert" = "Please login first";
"mgc_mini_game_api_check_login_message" = "No login at present";
"mgc_mini_game_api_check_nickname_alert" = "Nickname can't be empty";
"mgc_mini_game_api_check_portrait_alert" = "Head can't be empty";
"mgc_mini_game_api_check_mobile_message" = "Illegal input of mobile phone number";
"mgc_mini_game_api_clear_cache" = "ache Cleaning Successful";
"mgc_jump_manager_check_game_info_alert" = "Failure to get game information";//Failure to get game information
"mgc_jump_manager_check_net_alert" = "Please check the network";
"mgc_jump_manager_check_jump_info" = "Current version does not support";
"mgc_jump_manager_check_appid" = "Please introduce appId";
"mgc_mini_game_api_check_appid" = "Please configure appid";
"mgc_mini_game_api_check_bundleid" = "Configure a urlScheme identified as bundleId";
"mgc_jump_manager_check_jump_path" = "Please pass in the game package name or path";
"mgc_jump_manager_check_download_url" = "Please enter the download link of the game";
"mgc_jump_manager_check_version" = "Current system version lower%.1f,can't start game";
"mgc_jump_manager_check_black_list" = "The game has been blacklisted and cannot run!";
"mgc_data_cache_manager_check_url" = "Resource url is empty";
"mgc_data_cache_manager_check_net_status" = "Please check the network";
"mgc_data_cache_manager_loading_text" = "Loading";
"mgc_data_cache_manager_loading_fail" = "Failed to load";
"mgc_data_cache_manager_check_favorites_success" = "Success";
"mgc_data_cache_manager_check_favorites_fail" = "Failure of Game Information Acquisition";
"mgc_data_cache_manager_check_appId" = "appId is illegal";
"mgc_data_cache_manager_check_favorites_exist" = "Applications corresponding to this appId have been collected";
"mgc_data_cache_manager_check_favorites_match_fail" = "The collection list does not match the application information corresponding to appId";
"mgc_data_cache_manager_check_recent_match_fail" = "The list of recent games does not match the application information corresponding to appId";
"mgc_share_manage_platform_choose" = "Choose the Sharing Platform";
"mgc_share_modek_wechat_title" = "WeChat";
"mgc_share_manage_wechat_line_title" = "Wechat Friendship Circle";
"mgc_wmplayer_video_load_fail" = "Video Loading Failure";
"mgc_inner_buy_manager_status_fail" = "No Payable Order Number";
"mgc_inner_buy_manager_no_product_id" = "No product ID available for payment";
"mgc_inner_buy_manager_status_success" = "Successful payment";
"mgc_inner_buy_manager_status_pay_loading" = "Being paid";
"mgc_inner_buy_manager_status_pay_reuse" = "Resumption of purchase";
"mgc_trade_view_pay_success" = "Success";
"mgc_trade_view_pay_back" = "Return";
"mgc_net_manager_check_net" = "Please check the network";
"mgc_net_manager_net_fail" = "Network request error";
"mgc_net_manager_param_fail" = "Request parameter error";
"mgc_waitting_box_message" = "Loading";
"mgc_check_helper_message" = "The current network is unavailable, please check the network settings";
"mgc_ad_video_close" = "Close";
"mgc_ad_video_ext_btn_title" = "View details";
"mgc_ad_view_client_no_suit_ad" = "No suitable advertisement";
"mgc_ad_view_client_error_ad" = "Abnormal advertising data";
"mgc_ad_view_client_no_support" = "This platform is not supported";
"mgc_ad_bean_ext_button_title" = "Check now";
"mgc_guess_you_like_title" = "Guess you like";
"mgc_web_special_load_fail" = "Failed to load";
"mgc_web_special_warging_title" = "Warning";
"mgc_web_special_warging_alert" = "I see";
"mgc_web_special_choose_alert" = "Please choose";
"mgc_web_special_warging_alert_sure" = "Agree";
"mgc_web_special_warging_alert_cancel" = "Disagree";
"mgc_web_special_input_alert_title" = "Please input";
"mgc_web_special_input_alert_sure" = "Sure";
"mgc_web_special_input_alert_cancel" = "Cancel";

"mgc_login_view_mobile_input" = "Please enter your mobile phone number";
"mgc_login_view_check_code" = "Get the authentication code";
"mgc_login_view_check_code_please" = "Please enter the validation code";
"mgc_login_view_mobile_not_empty" = "Mobile phone number cannot be empty";
"mgc_login_view_mobile_real" = "Please enter the correct cell phone number";
"mgc_login_view_mobile_not_available" = "Illegal mobile phone number";
"mgc_login_view_login_and_register" = "Login/Registration";
"mgc_login_view_login_cancel" = "Cancel login";
"mgc_page_view_more_game_title" = "Games";
"mgc_waitting_box_load_default" = "Loading...";
"mgc_jump_manager_check_game_repeat" = "This game is running";
"mgc_jump_splash_game_version" = "Game version:";
"mgc_jump_splash_leto_version" = "Leto version:";
"mgc_jump_splash_des" = "Resist bad games, refuse pirated games. Pay attention to self-protection and guard against being deceived.\n Moderate games benefit the brain, indulge in games hurt the body. Reasonable arrangement of time, enjoy a healthy life.";
"mgc_jump_start_game_time_out" = "Game start fail";
"mgc_leto_start_param_check_fail" = "Game Id is nil";
"mgc_leto_start_app_check_fail" = "Game is running";
"mgc_leto_start_app_success" = "Game start success";
"mgc_leto_start_service_fail" = "service.html not fond";
"mgc_leto_start_copy_resource_fail" = "Source copy fail";
"mgc_leto_start_copy_app_fail" = "Apply copy fail";
"mgc_leto_start_unzip_source_fail" = "Resource unzip fail";
"mgc_jump_data_cache_file_save_fail" = "Resource download success, save failure";
"mgc_trade_view_pay_exit_login_again" = "This Account is exist. Before recharging, the game needs to be reloaded.";
"mgc_pay_faile_alert_title" = "Tips";
"mgc_pay_faile_alert_sure" = "Sure";
"mgc_game_start_time_out" = "Start time out";
"mgc_banner_ad_data_empty" = "Ad data empty";
"mgc_cache_zip_no_pass" = "Incomplete resources";


"mgc_setting_my_game_title" = "My Games";
"mgc_setting_look_all_title" = "Look All";//mgc_game_center_look_all_title
"mgc_game_center_setting_title" = "Set";
"mgc_mine_func_list_clear_cache_title" = "Clear cache";
"mgc_mine_func_list_timer_title" = "Display in-game timer";
"mgc_mine_cash_title" = "Cash withdrawal";
"mgc_mine_cash_right_title" = "Discount Record";
"mgc_favorites_navi_right_alert_title" = "Are you sure you want to clear the cache?";
"mgc_favorites_navi_right_alert_subTitle" = "Clearing the cache will make my game disappear.";
"mgc_favorites_alert_cancel_title" = "No";
"mgc_favorites_alert_sure_title" = "Yes";

"mgc_coin_today_get_title" = "Gold coins today";
"mgc_coin_my_balance_title" = "My gold balance";
"mgc_coin_entrance_title" = "Immediate cash withdrawal";
"mgc_cash_balance_sign_title" = "Gold balance: ";
"mgc_cash_rmb_des" = "    (About%.2fyuan)";
"mgc_cash_amount_sign" = "Yuan";
"mgc_cash_sec_header_title" = "Cash withdrawal";
"mgc_cash_sec_footer_title" = "Presentation Note\n";
"mgc_cash_get_money_title" = "Immediate cash withdrawal";
"mgc_cash_alert_not_enough_title" = "Your gold balance is insufficient";
"mgc_cash_alert_not_enough_cancel_title" = "Cancel";
"mgc_cash_alert_not_enough_sure_title" = "Sure";
"mgc_cash_alert_submit_title" = "The submission of the application is successful. Please wait patiently for review!";

"mgc_cash_bind_sec_str" = "Gold coin";
"mgc_cash_bind_third_str" = "My gold coin: ";
"mgc_cash_bind_forth_str" = "Yuan";
"mgc_cash_bind_icon_title" = "Game Acquisition";//绑定手机号
"mgc_cash_bind_video_sure_title" = "Watch the video receive";
"mgc_cash_bind_sure_subtitle" = "Receive immediately";
"mgc_cash_bind_sure_subtitle_close" = "Close";
"mgc_cash_bind_sure_title" = "Sure";


"mgc_mine_login_alert_title" = "Reminder";
"mgc_mine_login_alert_subtitle" = "To ensure that your earnings are normal, please bind your mobile phone number first.";
"mgc_mine_login_alert_code_nor_title" = "Get the authentication code";
"mgc_mine_login_alert_code_countdown_title" = "sReceive";
"mgc_mine_login_alert_field_mobile_placeholder" = "Please enter your cell phone number";
"mgc_mine_login_alert_field_code_placeholder" = "Please enter the verification code";
"mgc_mine_login_alert_sure_btn_title" = "Login/Register";


"mgc_mine_cash_record_title" = "Discount Record";
"mgc_mine_cash_record_noData_title" = "No cash withdrawal record";
"mgc_cash_bank_title" = "Bank card receipt";
"mgc_cash_bank_sure_title" = "Sure";
"mgc_cash_bank_choose_alert_cancel_title" = "Cancel";
"mgc_cash_bank_choose_alert_sure_title" = "Sure";
"mgc_cash_bank_model_name_sign_title" = "Name:";
"mgc_cash_bank_model_bank_sign_title" = "Opening Bank:";
"mgc_cash_bank_model_card_sign_title" = "Bank Card Number:";
"mgc_cash_bank_model_bank_placholder_title" = "Please select the bank to which the bank card belongs";
"mgc_cash_bank_model_card_placholder_title" = "Please enter your bank card number";
"mgc_cash_bank_model_name_placholder_title" = "Please enter your name";



"mgc_cash_info_title" = "Please confirm again whether the bank information is correct?";
"mgc_cash_info_cancel_title" = "Cancel";
"mgc_cash_info_sure_title" = "Sure";

"mgc_cash_info_name_sign" = "     Name:";
"mgc_cash_info_card_num_sign" = "     Bank Card Number:";
"mgc_cash_info_bank_sign" = "     Opening Bank:";
"mgc_cash_info_amount_sign" = "     Cash withdrawal:";
"mgc_cash_info_amount_symbol" = "yuan";


"mgc_cash_login_again_content" = "The Account has been registered. Switching to the account will result in the loss of the current gold balance. Do you want to continue?";
"mgc_cash_login_again_func_first_title" = "Continue";
"mgc_cash_login_again_func_sec_title" = "Other accounts";

"mgc_cash_record_title" = "Bank Card Cash";
"mgc_cash_record_status_1" = "To be audited";
"mgc_cash_record_status_2" = "The presentation is now accepted";
"mgc_cash_record_status_3" = "Audit rejection";
"mgc_cash_record_status_4" = "Cash failure";
"mgc_cash_record_status_5" = "Successful Account Arrival";
"mgc_cash_record_status_6" = "Failure to get to the account";
"mgc_no_register_block" = "No registered callback";


"mgc_float_window_splash_title_1" = "Drag me, you can change the position at will~";
"mgc_float_window_splash_title_2" = "A full circle of the timer yields a lot of gold coins";
"mgc_float_window_splash_title_3" = "The longer you play, the more rewards you get. There's no limit on gold coins";
"mgc_float_window_splash_title_4" = "Click on Hidden Timer and the reward will still be given~";

"mgc_coin_entrance_bsb_title" = "Exchange now";
"mgc_mine_cash_bsb_title" = "Exchange";
"mgc_mine_cash_right_bsb_title" = "Exchange record";
"mgc_cash_rmb_bsb_des" = "    (about%.2fR)";
"mgc_cash_sec_header_bsb_title" = "Exchange RanLi";
"mgc_cash_sec_footer_bsb_title" = "Exchange des\n";
"mgc_cash_amount_bsb_sign" = "N";
"mgc_cash_get_money_bsb_title" = "Exchange now";
"mgc_mine_cash_record_noData_bsb_title" = "No exchange record";
"mgc_coin_float_alert_hide_title" = "hiden";
"mgc_coin_float_alert_title" = "Game award\n";
"mgc_coin_service_btn_title" = "Service>";
"mgc_coin_hidden_timer_alert_cancel_title" = "Cancel";
"mgc_coin_hidden_timer_alert_sure_title" = "Sure";
"mgc_coin_hidden_timer_alert_first_title" = "Confirm Hidden Timer?\n";
"mgc_coin_hidden_timer_alert_second_title" = "Hidden can be opened in the settings-display gamen timer";
"mgc_game_center_bottom_wifi_des" = "ⓘ The content is provided by third-party";

"mgc_api_sync_info_empty" = "Synchronized  account information can't be empty";
"mgc_api_sync_login_sign_empty" = "Please config mgc_sync_loginsign_key";
"mgc_api_sync_userid_empty" = "Please config mgc_sync_userid_key";
"mgc_api_sync_mobile_or_userid_empty" = "Pleasse Config mgc_sync_userid_key or mgc_sync_mobile_key";
"mgc_api_sync_sdk_config_empty" = "Get sdk config infomation fail";

"mgc_game_center_alert_pptv_sign_title" = "Sign Get";
"mgc_game_center_alert_pptv_ext_des" = "More awards can be found in my prizes";
"mgc_game_center_alert_pptv_ext_des_special" = "in my prizes";
"mgc_game_center_alert_pptv_fir_btn_title" = "Gold coins on video";
"mgc_game_center_alert_pptv_sec_btn_title" = "Sure";
"mgc_leto_safe_warning" = "Need import LetoSafe.framework";
"mgc_leto_login_warning" = "Plaec login";
